{
    "moves": ";BR[6k]WR[6k]KM[6.5]RE[W+43.5]SZ[19];B[pd];W[dp];B[pq];W[dd];B[fq];W[hq];B[cq];W[dq];B[dr];W[er];B[cr];W[eq];B[bo];W[cp];B[bp];W[dn];B[cm];W[cn];B[bm];W[hn];B[ip];W[hp];B[qk];W[qo];B[po];W[pn];B[oo];W[qp];B[qq];W[rq];B[rr];W[sp];B[nq];W[rl];B[rk];W[ql];B[pl];W[pm];B[ol];W[lp];B[rn];W[rm];B[qn];W[ro];B[pf];W[cg];B[jc];W[md];B[gc];W[eb];B[pc];W[mb];B[lc];W[lb];B[kb];W[ld];B[mc];W[nc];B[kc];W[ob];B[nd];W[od];B[ne];W[oe];B[oc];W[nb];B[of];W[pb];B[qb];W[qc];B[rc];W[qd];B[pe];W[rb];B[qe];W[rd];B[re];W[sc];B[kf];W[id];B[je];W[jd];B[kd];W[ic];B[ib];W[he];B[ed];W[ec];B[ff];W[ee];B[fd];W[fe];B[ge];W[gf];B[gd];W[if];B[ef];W[de];B[gg];W[hf];B[hb];W[ih];B[fh];W[dj];B[gj];W[ij];B[ch];W[dh];B[di];W[ci];B[ei];W[ck];B[eh];W[dg];B[eg];W[gi];B[hi];W[ii];B[hg];W[ig];B[hh];W[hl];B[bh];W[df];B[ek];W[ej];B[fj];W[dl];B[dk];W[cj];B[el];W[bi];B[ki];W[mk];B[kk];W[mi];B[nj];W[mj];B[oh];W[ni];B[oj];W[oi];B[pi];W[ph];B[pg];W[pj];B[om];W[qi];B[on];W[qm];B[sl];W[sn];B[pk];W[mm];B[lq];W[kq];B[mp];W[lr];B[mq];W[lo];B[lh];W[km];B[gl];W[hk];B[dm];W[cl];B[fn];W[fp];B[go];W[gm];B[fm];W[ho];B[mr];W[ks];B[fr];W[es];B[gp];W[gq];B[ll];W[ml];B[lm];W[ln];B[mn];W[qg];B[qj];W[pi];B[rh];W[kj];B[ak];W[aj];B[rg];W[li];B[kh];W[ji];B[gn];W[hm];B[eo];W[ep];B[kp];W[jq];B[mo];W[kn];B[qh];W[ri];B[bn];W[en];B[em];W[fo];B[ds];W[fs];B[ms];W[nh];B[ng];W[jf];B[lg];W[nk];B[ok];W[pp];B[op];W[sm];B[fb];W[ea];B[sk];W[sh];B[sg];W[si];B[mh];W[sr];B[rs];W[bk];B[al];W[ls];B[co];W[do];B[se];W[sd];B[fa];W[cc];B[bl];W[bg];B[nm];W[gk];B[fk];W[ie];B[ke];W[ka];B[ja];W[la];B[hj];W[tt];B[hc];W[tt];B[tt]",
    "comments": "0|C[Hi, I've just completed my first ever kibitzed game and I'd like some advice on how to improve. My opponent was rated 1579 on KGS when we played the game (I am not sure what his current rating is). We both used handicaps of 4 stones each in this game.]6|C[I think this would be a bad move. If you are going for territory then you should look at the board and decide where to make an attack or defend. You could have gone into the corner with A.]8|C[This looks very slow. White has taken all the corners now so it seems silly to leave them undefended while playing elsewhere.]12|C[Black plays too slowly here. This does not really help white any more than the two previous moves did but it gives black an easy opportunity to play somewhere else.]13|C[A better response to B11 would have been R11.]17|C[White takes too much space here - he needs to take something small and make life difficult for black.]19|C[This is quite dangerous for white as it allows black to extend along the bottom side of the board easily.]24|C[Again white takes too much space - there is no need to extend upwards like that. He should aim for a point close by that he can connect to later.]26|C[Now black gets an even bigger wall.]27|C[White again fails to respond properly to blacks earlier extension.]31|C[It seems strange that white has allowed black to get so far ahead.]33|C[Here white makes another mistake - he should have connected with A.]35|C[White still fails to respond to blacks large extensions.]36|C[Again white misses out on a chance to attack.]37|C[At this point white should be able to win if he concentrates on making life easier for himself. It doesn't matter about the ko threats as they will come back to bite him anyway.]40|C[Another missed opportunity...]42|C[The only reason why black wants to play here is because of the weakness at Q14. If white had played there instead of G15 then this exchange would have been unnecessary.]44|C[White again fails to seize the initiative.]46|C[This is too big.]54|C[White should play at O11 instead.]57|C[There is no way that white can live in this position.]60|C[White should resign here.]64|C[Black has already got enough points to survive.]65|C[I think this is wrong.]66|C[This is too late - white cannot save anything here.]72|C[This is also too late.]74|C[This is a huge overplay. Black should ignore it completely.]75|C[This is good for black - white is giving away lots of territory without getting anything worthwhile in return.]76|C[This is a little too aggressive.]82|C[This is a bit of a joke.]86|C[This is a mistake. There is no need to fight yet.]87|C[This is also a mistake. The game is lost so there is no need to worry about fighting.]88|C[Black is almost certain to lose this one.]93|C[Again - this is a mistake. There is no need to fight yet. Black should simply run out.]104|C[White should try to kill here.]105|C[White cannot save the group here.]112|C[This move is useless. All white gains from it is a few extra points. It does nothing to stop black taking the lead.]115|C[If white wanted to end the game quickly he should have ignored blacks last three moves. They do not hurt him and only give black more influence.]118|C[Once again white should ignore black and just run out. He is behind anyway.]122|C[This is the final result. Black wins by around 40 points.]"
  }